In [2]:
#q1
str = input()
letters,digits,symbols=0,0,0
for i in str:
    if i.isalpha()==True:
        letters+=1
    elif i.isdigit()==True:
        digits+=1
    else:
        symbols+=1

print(letters,digits,symbols)

16 0 0

In [3]:
#q2 numbers divisible by nineteen or thirteen from a list of numbers

a=[19,65,57,152,639,121,44,90,190]
list(filter(lambda x: x%19==0 or x%13==0,a))

[19, 65, 57, 152, 190]

In [6]:
#q3
string = "Practice Problems to Drill List Comprehension in Your Head"

list(filter(lambda x:len(x)<5,string.split()))

['to', 'List', 'in', 'Your', 'Head']

In [58]:
#q4
taxable_income = int(input("Enter your taxable income: "))


if taxable_income <= 10000:
    tax = 0
elif taxable_income <= 20000:
    tax = (taxable_income - 10000) * 0.1
else:
    tax = 10000 * 0.1 + (taxable_income - 20000) * 0.2

print("The income tax payable is: $", tax)

The income tax payable is: $ 43464.600000000006

In [7]:
#q5
#separate positive and negative comments
positive = ['good','awesome', 'best', 'nice']
negative = ['worst','awful', 'bad']

tweets = ['This government policies are good', 'bad implementation', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', 'The wine tastes awful', "It's nice to hear this little kid's laugh"]

positive = [x for x in tweets for y in x.split() if y in positive]
negative = [x for x in tweets for y in x.split() if y in negative]
print(positive)
print(negative)

['This government policies are good', 'The way he played showed that he is one of the best players in the world', 'Her acting in the play was awesome', "It's nice to hear this little kid's laugh"]
['bad implementation', 'The wine tastes awful']

In [12]:
#q6
list1 = ["a", "b", ["c", ["d", "e", ["f", "g"], "k"], "l"], "m", "n"]
sub_list = ["h", "i", "j"]

list1[2][1][2].extend(sub_list)
list1

['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

In [1]:
#q7
list = [54,44,27,79,91,41]
list.insert(1,list.pop(4))
list.append(list[1])
list

[54, 91, 44, 27, 79, 41, 91]

In [33]:
#q8
import pandas as pd
main_data=pd.read_csv('resources/iris.csv')
main_data

,sepal length in cm,sepal width in cm,petal length in cm,petal width in cm,outputs
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

In [37]:
# main_data.rename(columns = {'sepal length in cm':'spLength'}, inplace = True)
# main_data.rename(columns = {'sepal width in cm':'spWidth'}, inplace = True)
main_data[(main_data['sepal length in cm']==5.1) & (main_data['sepal width in cm']==3.5)]

,sepal length in cm,sepal width in cm,petal length in cm,petal width in cm,outputs
0,5.1,3.5,1.4,0.2,Iris-setosa
17,5.1,3.5,1.4,0.3,Iris-setosa

In [54]:
#q9
maximum = main_data['petal length in cm'].max()
minimum = main_data['petal length in cm'].min()
main_data['petal length in cm']=main_data['petal length in cm'].replace(maximum,7.2)
main_data['petal length in cm']=main_data['petal length in cm'].replace(minimum,1.2)
main_data['petal length in cm'].max(),main_data['petal length in cm'].min()

(7.2, 1.2)

In [55]:
#q10
data1 = {
    'ID': [101, 102, 103, 104, 105, 106, 107],
    'Candidate_Name': ['Alex', 'Amy', 'Allen', 'Alice', 'James', 'Sara', 'Mia'],
    'Subject': ['History', 'English', 'Geography', 'German', 'History', 'German', 'English']
}

data2 = {
    'ID': [101, 102, 103, 104, 105, 108],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'Chennai', 'Hyderabad', 'Delhi'],
    'Subject_Score': [89, 78, 77, 87, 87, 84]
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [57]:
df1.merge(df2, on='ID', how='right')

    ID Candidate_Name    Subject       City  Subject_Score
0  101           Alex    History      Delhi             89
1  102            Amy    English     Mumbai             78
2  103          Allen  Geography      Delhi             77
3  104          Alice     German    Chennai             87
4  105          James    History  Hyderabad             87
5  108            NaN        NaN      Delhi             84